Repository: nik-conder/fin-control-flutter
Catalog: lib/l10n/app_*.arb
Languages: ru

source: Dark mode
ru: Тёмный режим

source: Light mode
ru: Светлый режим

source: Settings
ru: Настройки

source: Home
ru: Главная

source: Login
ru: Вход

source: Logout
ru: Выйти

source: New profile
ru: Новый профиль

source: Not profile
ru: Профили не найдены

source: Loading
ru: Загрузка

source: No data
ru: Нет данных

# data_is_hidden_description
source: Enable balance display in Settings
ru: Включите отображение баланса в Настройка

# wait
source: Please, wait..
ru: Пожалуйста, подождите..

source: Create new profile
ru: Создайте новый профиль

# created_profile
source: New profile created
ru: Новый профиль создан

# create_profile_description
source: To continue, you need to give a name to the new profile and select a currency. Please note that it will not be possible to change the currency after creating the account.
ru: Для продолжения необходимо дать название новому профилю и выбрать валюту. Обратите внимание, что после создания счета изменить валюту будет невозможно.

# name_profile_example
source: For example: «Account #1» or «Main Account»
ru: Например: «Счёт #1» или «Основной счёт»

source: Profile name
ru: Название профиля

source: Create
ru: Создать

source: Next
ru: Далее

source: More..
ru: Ещё..

source: In development..
ru: В разработке..

# advice_title_1
source: Always set aside a portion of your income
ru: Постоянно откладывайте часть своих доходов

# advice_title_2
source: Manage your expenses
ru: Управляйте своими расходами

# advice_title_3
source: Invest your money
ru: Инвестируйте свои деньги

# advice_title_4
source: Manage your debt
ru: Управляйте своим долгом

# advice_title_5
source: Build a financial safety net
ru: Образуйте финансовую подушку безопасности.

# advice_description_1
source: Strive to save at least 20% of your income as savings. If you start this practice today, you can create a fund for future needs and significantly improve your financial situation.
ru: Стремитесь к тому, чтобы откладывать не менее 20% своего дохода в качестве накоплений. Если вы начнете эту практику сегодня, то сможете создать капитал для будущих нужд и решительно улучшить свое финансовое положение.

# advice_description_2
source: Regularly analyze your expenses and look for opportunities to save. For example, you can cancel unnecessary subscriptions, buy cheaper products, save on energy costs, etc.
ru: Проводите регулярный анализ своих трат и ищите возможности сэкономить. Например, можно отказаться от ненужных подписок, покупать дешевле продукты, экономить на энергозатратах и т.д.

# advice_description_3
source: Investing is one of the most effective ways to increase your savings. Diversify your portfolio by investing in stocks, bonds, real estate, and other types of investments.
ru: Инвестирование - это один из наиболее эффективных способов увеличить свои сбережения. Разнообразьте свой портфель, вкладывая деньги в акции, облигации, недвижимость и другие виды инвестиций.

# advice_description_4
source: If you have debts, plan your repayments and reduce interest rates. Try to pay off loans and debts on time to avoid penalties and additional costs.
ru: Если у вас есть долги, планируйте их выплату и снижайте процентные ставки. Старайтесь выплачивать кредиты и задолженности вовремя, чтобы избежать штрафов и дополнительных затрат.

# advice_description_5
source: Build up enough money for unexpected expenses. This can be the equivalent of three to six months worth of living expenses. Such a safety net will help you avoid financial problems in case of job loss, unexpected repair costs, or medical expenses.
ru: Накопите достаточно денег на случай неожиданных расходов. Это может быть эквивалентом от трех до шести месяцев расходов на жизнь. Такая подушка позволит избежать финансовых проблем в случае увольнения, неожиданных расходов на ремонт или медицинские услуги.

# block_useful_tips_setting
source: "Useful tips" block
ru: Блок «Полезные советы»

source: Transaction Grid
ru: Сетка транзакций

# transaction_grid_description
source: Adaptive grid for the size of your screen
ru: Адаптивная сетка под размер вашего экрана

# block_useful_tips_setting_description
source: Will not be displayed in the Home
ru: Не будет отображаться на Главной

source: Hidden balance
ru: Баланс скрыт

# hide_balance_description
source: Hide the balance from prying eyes
ru: Скройте баланс от посторонних глаз

source: Profile
ru: Профиль

source: Delete
ru: Удалить

source: Error
ru: Ошибка

source: Unknown error
ru: Неизвестная ошибка

# emptyProfileName
source: The profile name cannot be empty
ru: Название профиля не может быть пустым

# shortProfileName
source: The profile name cannot be short
ru: Название профиля не может быть коротким

# longProfileName
source: The profile name cannot be long
ru: Название профиля не может быть длинным

# errorCreateProfile
source: Error profile create
ru: При создании профиля произошла ошибка

# select_action
source: Select an action
ru: Выберите действие

source: Edit
ru: Редактировать
